Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
bidirectional (Bidirectional (None, 800)               1376000   
_________________________________________________________________
repeat_vector (RepeatVector) (None, 29, 800)           0         
_________________________________________________________________
bidirectional_1 (Bidirection (None, 29, 700)           3222800   
_________________________________________________________________
time_distributed (TimeDistri (None, 29, 29)            20329     
=================================================================
Total params: 4,619,129
Trainable params: 4,619,129
Non-trainable params: 0
_________________________________________________________________
